Revit.Application.FamilyDocument.AddParameter(System.String,Revit.Elements.GroupType,Revit.Elements.SpecType,System.Boolean)
Add a new family parameter with a given name.
parameterName: The name of the new family parameter.
groupType: The type of the group to which the family parameter belongs.
specType: The type of new family parameter.
isInstance: Indicates if the new family parameter is instance or type (true if parameter should be instance).
Returns: